Uppdaterad architecture.md
